Catalogs/УлицыГородов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>УлицыГородов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Область</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаселенныйПункт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазваниеУлицы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндексГорода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/УлицыГородов/Forms/ФормаЗагрузкиИзEXCEL/Ext/Form/Module.bsl
&НаКлиенте
Процедура ФайлНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Режим = РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = Файл;
	Фильтр = "Электронная таблица Excel(*.xlsx)|*.xlsx";
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = НСтр("ru='Выберите файл';uk='Виберіть файл'");
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		Файл = ДиалогОткрытияФайла.ПолноеИмяФайла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	Путь = Файл;
	Если НЕ ЗначениеЗаполнено(Файл) Тогда
		Сообщить(НСтр("ru='Укажите путь к файлу.';uk='Вкажіть шлях до файлу.'"));
		Возврат;
	КонецЕсли;
	Если Список.Количество() > 0 Тогда
		Ответ = Вопрос(НСтр("ru='Табличная часть будет очищена! Продолжить выполнение операции?';uk='Таблична частина буде очищена! Продовжити виконання операції'"), РежимДиалогаВопрос.ДаНет, 0);
		Если Ответ <> КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли; 
	КонецЕсли;
	Список.Очистить();
	Попытка
		Excel = Новый COMОбъект("Excel.application");	
	Исключение
		Сообщить(НСтр("ru='Не удалось подключиться';uk='Не вдалося підключитися'") + информацияОбОшибке());
		Возврат;
	КонецПопытки;
	
	Excel.Workbooks.Open(Путь);
	Sheet = Excel.Sheets(1);
	Sheet = Excel.ActiveWorkbook;
	КоличествоСтрок = Excel.ActiveSheet.UsedRange.Rows.Count();
	
	Для Счетчик = 2 По КоличествоСтрок Цикл
		НоваяСтрока = Список.Добавить();
		НоваяСтрока.Область = Excel.Cells(Счетчик, 2).Value;
		НоваяСтрока.Район   = Excel.Cells(Счетчик, 3).Value;
		НоваяСтрока.Город   = Excel.Cells(Счетчик, 4).Value;
		НоваяСтрока.НаселенныйПункт = Excel.Cells(Счетчик, 5).Value;
		НоваяСтрока.НазваниеУлицы =   Excel.Cells(Счетчик, 6).Value;
		НоваяСтрока.Индекс = Excel.Cells(Счетчик, 7).Value;
	КонецЦикла;
	Excel.Workbooks.Close();
	Excel.Quit();
КонецПроцедуры

&НаСервере
Процедура ИмпортНаСервере()
	Для Каждого стр Из Список Цикл
		Если стр.Район = "" И стр.Город = "" И стр.НазваниеУлицы = "" Тогда
			НовСправочник = Справочники.УлицыГородов.СоздатьГруппу();
			НовСправочник.Наименование = стр.Область;
			НовСправочник.Записать();
		ИначеЕсли стр.Район = "" И стр.НазваниеУлицы = "" Тогда
			НовСправочник = Справочники.УлицыГородов.СоздатьГруппу();
			НовСправочник.Родитель = Справочники.УлицыГородов.НайтиПоНаименованию(стр.Область);
			НовСправочник.Наименование = стр.Город;
			НовСправочник.Записать();
		ИначеЕсли стр.Город = "" И стр.НазваниеУлицы = "" Тогда
			НовСправочник = Справочники.УлицыГородов.СоздатьГруппу();
			НовСправочник.Родитель = Справочники.УлицыГородов.НайтиПоНаименованию(стр.Область);
			НовСправочник.Наименование = стр.Район;
			НовСправочник.Записать();
		ИначеЕсли стр.НазваниеУлицы = "" Тогда
			НовСправочник = Справочники.УлицыГородов.СоздатьГруппу();
			НовСправочник.Родитель = Справочники.УлицыГородов.НайтиПоНаименованию(стр.Район);
			НовСправочник.Наименование = стр.Город;
			НовСправочник.Записать();
		Иначе
			ЕлементСпр = Справочники.УлицыГородов.СоздатьЭлемент();
		    ЕлементСпр.Родитель = Справочники.УлицыГородов.НайтиПоНаименованию(стр.Город);
			ЕлементСпр.Город = стр.Город;
			ЕлементСпр.НазваниеУлицы = стр.НазваниеУлицы;
			ЕлементСпр.НаселенныйПункт = стр.НаселенныйПункт;
			ЕлементСпр.Область = стр.Область;
			ЕлементСпр.Район = стр.Район;
			ЕлементСпр.НаименованиеПолное = СложитьПредставление(стр);
			ЕлементСпр.Наименование = ЕлементСпр.НаименованиеПолное;
			ЕлементСпр.ИндексГорода = стр.Индекс;
			ЕлементСпр.Записать();
		КонецЕсли;
	    
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Импорт(Команда)
	ИмпортНаСервере();
КонецПроцедуры

&НаСервере
Функция СложитьПредставление(стрТабЧасти);
	Представление = "";
	Если стрТабЧасти.Индекс <> "" Тогда
		Представление = стрТабЧасти.Индекс + ", ";
	КонецЕсли;
	Если стрТабЧасти.Область <> "" Тогда
		Представление = Представление + стрТабЧасти.Область;
	КонецЕсли;
	Если стрТабЧасти.Район <> "" Тогда
		Представление = Представление + ", " + стрТабЧасти.Район;
	КонецЕсли;
	Если стрТабЧасти.Город <> "" Тогда
		Представление = Представление + ", " + стрТабЧасти.Город;
	КонецЕсли;
	Если стрТабЧасти.НаселенныйПункт <> "" Тогда
		Представление = Представление + ", " + стрТабЧасти.НаселенныйПункт;
	КонецЕсли;
	Если стрТабЧасти.НазваниеУлицы <> "" Тогда
		Представление = Представление + ", " + стрТабЧасти.НазваниеУлицы;
	КонецЕсли;
	Возврат Представление;
КонецФункции;
